%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 版权声明：
%     本程序的详细中文注释请参考
%     黄小平，王岩，缪鹏程.粒子滤波原理及应用[M].电子工业出版社，2017.4
%     书中有原理介绍+例子+程序+中文注释
%     如果此程序有错误，请对提示修改
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 函数功能：      参数拟合a,b,c,d
% 非线性函数方程： Q(k)=a*exp(b*k)+c*exp(d*k)
% 其中Q(k),k通过Battery_Capacity文件给定
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [a,b,c,d]=para_fit(n)
 
load Battery_Capacity
 
cftool(A3Cycle,A3Capacity)
cftool(A8Cycle,A8Capacity)
cftool(A5Cycle,A5Capacity)
cftool(A12Cycle,A12Capacity)
 