%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 版权声明：
%     本程序的详细中文注释请参考
%     黄小平，王岩，缪鹏程.粒子滤波原理及应用[M].电子工业出版社，2017.4
%     书中有原理介绍+例子+程序+中文注释
%     如果此程序有错误，请对提示修改
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 这是一个测试画图的程序，用于画不同的线型
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function main1 
A1=randn(1,10);
A2=randn(1,10);
A3=randn(1,10);

figure 
box on
hold on; 
plot(A1,'-r') 
plot(A2,'-.g') 
plot(A3,'-b.')
xlabel('X-axis')
ylabel('Y-axis')

figure
box on
hold on; 
plot(A1,'-ko','MarkerFaceColor','r') 
plot(A2,'-cd','MarkerFaceColor','g') 
plot(A3,'-bs','MarkerFaceColor','b')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%