%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 版权声明：
%     本程序的详细中文注释请参考
%     黄小平，王岩，缪鹏程.粒子滤波原理及应用[M].电子工业出版社，2017.4
%     书中有原理介绍+例子+程序+中文注释
%     如果此程序有错误，请对提示修改
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 文件名称：main.m
% 功能说明：
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function main361
error('下面的参数N请参考书中的值设置，然后删除本行代码')
N=0;
 
MEAN=0;
 
VAR=1;
 
X=MEAN+VAR*randn(1,N);
 
Y=zeros(1,N);
Y(1)=X(1);
for k=2:N
    Y(k)=X(k)+0.5*X(k-1);
end
 
[Fx fx]=myFFT(X',512);
Zx=1/N*Fx.*conj(Fx);
 
[Fy fy]=myFFT(Y',512);
Zy=1/N*Fy.*conj(Fy);
 
figure
subplot(2,1,1)
plot(X,'-b');
xlabel('k');
ylabel('白噪声')
subplot(2,1,2)
plot(Y,'-b','MarkerFace','g');
xlabel('k');
ylabel('有色噪声')
  
figure
subplot(2,1,1);
plot(fx,Zx);
xlabel('k');
ylabel('白噪声的频谱')

subplot(2,1,2);
plot(fy,Zy);
xlabel('k');
ylabel('有色噪声的频谱')
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%


