%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 版权声明：
%     本程序的详细中文注释请参考
%     黄小平，王岩，缪鹏程.粒子滤波原理及应用[M].电子工业出版社，2017.4
%     书中有原理介绍+例子+程序+中文注释
%     如果此程序有错误，请对提示修改
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  说明：几何概率模拟实验
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function main436
P=0.5;
error('下面的参数N请参考书中的值设置，然后删除本行代码')
N=0;  
fun(P,N); 
 
function fun(p,mm)
E=zeros(1,mm);
 
randnum1 = binornd(1,p,1,mm);
randnum2 = unidrnd(6,1,mm);
 
k1=0;
k2=0;
k3=0;
for i=1:mm
    if randnum1(i)==0         
        k1=k1+1; 
    else
        if randnum2(i)<=3            
            k1=k1+1; 
        elseif  randnum2(i)==6              
            k3=k3+1; 
        else
            k2=k2+1; 
        end
    end
   E(i)=(k2+k3)/i;    
end  
 
num=1:mm;
plot(num,E)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
